Reports/20191115_205706/BDD Feature/Cucumber Runner Test Suite/20191115_205706/requests/main/35.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-11-15T14:57:42.850Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.dneonline.com/calculator.asmx?wsdl",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "wsdl",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <Subtract xmlns=\"http://tempuri.org/\">\n            <intA>5</intA>\n            <intB>7</intB>\n        </Subtract>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 346,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><SubtractResponse xmlns=\"http://tempuri.org/\"><SubtractResult>-2</SubtractResult></SubtractResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 346,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "blocked" : -1,
        "receive" : 0,
        "dns" : -1,
        "send" : 0,
        "wait" : 0,
        "connect" : 516
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "35",
        "testObjectId" : "Object Repository/Calculator API/Subtract Numbers",
        "harId" : "5ee9f991-8e6c-46d4-a50d-cf887a7fb144",
        "reportFolder" : null
      },
      "time" : 516
    } ],
    "comment" : ""
  }
}